## **Explicit Indexes**

### **Setting & removing indexes**

`pandas` allows you to designate columns as an index. This enables cleaner code when taking subsets (as well as providing more efficient lookup under some circumstances).

In this chapter, you'll be exploring `temperatures`, a DataFrame of average temperatures in cities around the world. `pandas` is loaded as `pd`.

In [1]:
import pandas as pd

- Look at `temperatures`.

In [2]:
temperatures = pd.read_csv("./DataSets/temperatures.csv")
temperatures.head()

         date     city        country avg_temp_c
0  2000-01-01  Abidjan  Côte D'Ivoire     27.293
1  2000-02-01  Abidjan  Côte D'Ivoire     27.685
2  2000-03-01  Abidjan  Côte D'Ivoire     29.061
3  2000-04-01  Abidjan  Côte D'Ivoire     28.162
4  2000-05-01  Abidjan  Côte D'Ivoire     27.547

- Set the index of `temperatures` to `"city"`, assigning to `temperatures_ind`.

In [3]:
# Index temperatures by city
temperatures_ind = temperatures.set_index("city")

- Look at `temperatures_ind`. How is it different from *temperatures*?

In [4]:
temperatures_ind.head()

               date        country avg_temp_c
city
Abidjan  2000-01-01  Côte D'Ivoire     27.293
Abidjan  2000-02-01  Côte D'Ivoire     27.685
Abidjan  2000-03-01  Côte D'Ivoire     29.061
Abidjan  2000-04-01  Côte D'Ivoire     28.162
Abidjan  2000-05-01  Côte D'Ivoire     27.547

- Reset the index of `temperatures_ind`, keeping its contents.

In [5]:
# Reset the index, keeping its contents
temperatures_ind.reset_index().head()

      city        date        country avg_temp_c
0  Abidjan  2000-01-01  Côte D'Ivoire     27.293
1  Abidjan  2000-02-01  Côte D'Ivoire     27.685
2  Abidjan  2000-03-01  Côte D'Ivoire     29.061
3  Abidjan  2000-04-01  Côte D'Ivoire     28.162
4  Abidjan  2000-05-01  Côte D'Ivoire     27.547

- Reset the index of `temperatures_ind`, dropping its contents.

In [6]:
temperatures_ind.reset_index(drop=True).head()

         date        country avg_temp_c
0  2000-01-01  Côte D'Ivoire     27.293
1  2000-02-01  Côte D'Ivoire     27.685
2  2000-03-01  Côte D'Ivoire     29.061
3  2000-04-01  Côte D'Ivoire     28.162
4  2000-05-01  Côte D'Ivoire     27.547

### **Subsetting with `.loc[]`**

The killer feature for indexes is `.loc[]`: a subsetting method that accepts index values. When you pass it a single argument, it will take a subset of rows.

The code for subsetting using `.loc[]` can be easier to read than standard square bracket subsetting, which can make your code less burdensome to maintain.

`pandas` is loaded as `pd`. `temperatures` and `temperatures_ind` are available; the `latter` is indexed by city.

- Create a list of cities to subset on: Moscow and Saint Petersburg. Assign to `cities`.

In [7]:
# Make a list of cities to subset on
cities = ["Moscow","Saint Petersburg"]

- Use `[]` subsetting to filter `temperatures` for rows where the `city` column takes a value in `cities`.

In [8]:
# Subset temperatures using square brackets
temperatures[temperatures["city"].isin(cities)]

             date              city country avg_temp_c
10725  2000-01-01            Moscow  Russia     -7.313
10726  2000-02-01            Moscow  Russia     -3.551
10727  2000-03-01            Moscow  Russia     -1.661
10728  2000-04-01            Moscow  Russia     10.096
10729  2000-05-01            Moscow  Russia     10.357
...           ...               ...     ...        ...
13360  2013-05-01  Saint Petersburg  Russia     12.355
13361  2013-06-01  Saint Petersburg  Russia     17.185
13362  2013-07-01  Saint Petersburg  Russia     17.234
13363  2013-08-01  Saint Petersburg  Russia     17.153
13364  2013-09-01  Saint Petersburg  Russia        NaN

[330 rows x 4 columns]

- Use `.loc[]` subsetting to filter `temperatures_ind` for rows where the city is in `cities`.

In [9]:
# Subset temperatures_ind using .loc[]
temperatures_ind.loc[cities]

                        date country avg_temp_c
city
Moscow            2000-01-01  Russia     -7.313
Moscow            2000-02-01  Russia     -3.551
Moscow            2000-03-01  Russia     -1.661
Moscow            2000-04-01  Russia     10.096
Moscow            2000-05-01  Russia     10.357
...                      ...     ...        ...
Saint Petersburg  2013-05-01  Russia     12.355
Saint Petersburg  2013-06-01  Russia     17.185
Saint Petersburg  2013-07-01  Russia     17.234
Saint Petersburg  2013-08-01  Russia     17.153
Saint Petersburg  2013-09-01  Russia        NaN

[330 rows x 3 columns]

### **Setting multi-level indexes**

Indexes can also be made out of multiple columns, forming a multi-level index (sometimes called a hierarchical index). There is a trade-off to using these.

The benefit is that multi-level indexes make it more natural to reason about nested categorical variables. For example, in a clinical trial you might have control and treatment groups. Then each test subject belongs to one or another group, and we can say that a test subject is nested inside treatment group. Similarly, in the temperature dataset, the city is located in the country, so we can say a city is nested inside country.

The main downside is that the code for manipulating indexes is different from the code for manipulating columns, so you have to learn two syntaxes, and keep track of how your data is represented.

`pandas` is loaded as `pd`. `temperatures` is available.

- Set the index of `temperatures` to the `"country"` and `"city"` columns, and assign this to `temperatures_ind`.

In [10]:
# Index temperatures by country & city
temperatures_ind = temperatures.set_index(["country","city"])
temperatures_ind

                             date avg_temp_c
country       city
Côte D'Ivoire Abidjan  2000-01-01     27.293
              Abidjan  2000-02-01     27.685
              Abidjan  2000-03-01     29.061
              Abidjan  2000-04-01     28.162
              Abidjan  2000-05-01     27.547
...                           ...        ...
China         Xian     2013-05-01     18.979
              Xian     2013-06-01     23.522
              Xian     2013-07-01     25.251
              Xian     2013-08-01     24.528
              Xian     2013-09-01        NaN

[16500 rows x 2 columns]

- Specify two country/city pairs to keep: `"Brazil"`/`"Rio De Janeiro"` and `"Pakistan"`/`"Lahore"`, assigning to `rows_to_keep`.

In [11]:
# List of tuples: Brazil, Rio De Janeiro & Pakistan, Lahore
rows_to_keep = [("Brazil","Rio De Janeiro"), ("Pakistan","Lahore")]

- Print and subset `temperatures_ind` for `rows_to_keep` using `.loc[]`.

In [12]:
# Subset for rows to keep
temperatures_ind.loc[rows_to_keep]

                               date avg_temp_c
country  city
Brazil   Rio De Janeiro  2000-01-01     25.974
         Rio De Janeiro  2000-02-01     26.699
         Rio De Janeiro  2000-03-01     26.270
         Rio De Janeiro  2000-04-01     25.750
         Rio De Janeiro  2000-05-01     24.356
...                             ...        ...
Pakistan Lahore          2013-05-01     33.457
         Lahore          2013-06-01     34.456
         Lahore          2013-07-01     33.279
         Lahore          2013-08-01     31.511
         Lahore          2013-09-01        NaN

[330 rows x 2 columns]

### **Sorting by index values**

Previously, you changed the order of the rows in a DataFrame by calling `.sort_values()`. It's also useful to be able to sort by elements in the index. For this, you need to use `.sort_index()`.

`pandas` is loaded as `pd`. `temperatures_ind` has a multi-level index of `country` and `city`, and is available.

- Sort `temperatures_ind` by the index values.

In [13]:
# Sort temperatures_ind by index values
temperatures_ind.sort_index()

                          date avg_temp_c
country     city
Afghanistan Kabul   2000-01-01      3.326
            Kabul   2000-02-01      3.454
            Kabul   2000-03-01      9.612
            Kabul   2000-04-01     17.925
            Kabul   2000-05-01     24.658
...                        ...        ...
Zimbabwe    Harare  2013-05-01     18.298
            Harare  2013-06-01     17.020
            Harare  2013-07-01     16.299
            Harare  2013-08-01     19.232
            Harare  2013-09-01        NaN

[16500 rows x 2 columns]

- Sort `temperatures_ind` by the index values at the `"city"` level.

In [14]:
# Sort temperatures_ind by index values at the city level
temperatures_ind.sort_index(level="city")

                      date avg_temp_c
country city
Turkey   Izmir  2000-01-01      7.924
         Izmir  2000-02-01     10.263
         Izmir  2000-03-01     11.389
         Izmir  2000-04-01     16.504
         Izmir  2000-05-01     20.281
...                    ...        ...
        tanbul  2013-05-01     19.384
        tanbul  2013-06-01     21.853
        tanbul  2013-07-01     23.553
        tanbul  2013-08-01     24.724
        tanbul  2013-09-01        NaN

[16500 rows x 2 columns]

- Sort `temperatures_ind` by ascending country then descending `city`.

In [15]:
# Sort temperatures_ind by country then descending city
temperatures_ind.sort_index(level=["country","city"],ascending=[True,False])

                          date avg_temp_c
country     city
Afghanistan Kabul   2000-01-01      3.326
            Kabul   2000-02-01      3.454
            Kabul   2000-03-01      9.612
            Kabul   2000-04-01     17.925
            Kabul   2000-05-01     24.658
...                        ...        ...
Zimbabwe    Harare  2013-05-01     18.298
            Harare  2013-06-01     17.020
            Harare  2013-07-01     16.299
            Harare  2013-08-01     19.232
            Harare  2013-09-01        NaN

[16500 rows x 2 columns]

## **Slicing and Subsetting with `.loc` and `.iloc`**

### **Slicing index values**

Slicing lets you select consecutive elements of an object using `first:last` syntax. DataFrames can be sliced by index values, or by row/column number; we'll start with the first case. This involves slicing inside the `.loc[]` method.

Compared to slicing lists, there are a few things to remember.

- You can only slice an index if the index is sorted (using `.sort_index()`).
- To slice at the outer level, `first` and `last` can be strings.
- To slice at inner levels, `first` and `last` should be tuples.
- If you pass a single slice to `.loc[]`, it will slice the rows.

`pandas` is loaded as `pd`. `temperatures_ind` has country and city in the index, and is available.

- Sort the index of `temperatures_ind`.

In [16]:
# Sort the index of temperatures_ind
temperatures_srt = temperatures_ind.sort_index()

- Use slicing with `.loc[]` to get these subsets:
    - from Pakistan to Russia.
    - from Lahore to Moscow. (This will return nonsense.)
    - from Pakistan, Lahore to Russia, Moscow.

In [17]:
# Subset rows from Pakistan to Russia
temperatures_srt.loc["Pakistan":"Russia"]

                                 date avg_temp_c
country  city
Pakistan Faisalabad        2000-01-01     12.792
         Faisalabad        2000-02-01     14.339
         Faisalabad        2000-03-01     20.309
         Faisalabad        2000-04-01     29.072
         Faisalabad        2000-05-01     34.845
...                               ...        ...
Russia   Saint Petersburg  2013-05-01     12.355
         Saint Petersburg  2013-06-01     17.185
         Saint Petersburg  2013-07-01     17.234
         Saint Petersburg  2013-08-01     17.153
         Saint Petersburg  2013-09-01        NaN

[1155 rows x 2 columns]

In [18]:
# Try to subset rows from Lahore to Moscow
temperatures_srt.loc["Lahore":"Moscow"]

                          date avg_temp_c
country city
Mexico  Mexico      2000-01-01     12.694
        Mexico      2000-02-01     14.677
        Mexico      2000-03-01     17.376
        Mexico      2000-04-01     18.294
        Mexico      2000-05-01     18.562
...                        ...        ...
Morocco Casablanca  2013-05-01     19.217
        Casablanca  2013-06-01     23.649
        Casablanca  2013-07-01     27.488
        Casablanca  2013-08-01     27.952
        Casablanca  2013-09-01        NaN

[330 rows x 2 columns]

In [19]:
# Subset rows from Pakistan, Lahore to Russia, Moscow
temperatures_srt.loc[("Pakistan","Lahore"):("Russia","Moscow")]

                       date avg_temp_c
country  city
Pakistan Lahore  2000-01-01     12.792
         Lahore  2000-02-01     14.339
         Lahore  2000-03-01     20.309
         Lahore  2000-04-01     29.072
         Lahore  2000-05-01     34.845
...                     ...        ...
Russia   Moscow  2013-05-01     16.152
         Moscow  2013-06-01     18.718
         Moscow  2013-07-01     18.136
         Moscow  2013-08-01     17.485
         Moscow  2013-09-01        NaN

[660 rows x 2 columns]

### **Slicing in both directions**

You've seen slicing DataFrames by rows and by columns, but since DataFrames are two dimensional objects it is often natural to slice both dimensions at once. That is, by passing two arguments to `.loc[]`, you can subset by rows and columns in one go.

`pandas` is loaded as `pd`. `temperatures_srt` is indexed by country and city, has a sorted index, and is available.

- Use `.loc[]` slicing to subset rows from India, Hyderabad to Iraq, Baghdad.

In [20]:
# Subset rows from India, Hyderabad to Iraq, Baghdad
temperatures_srt.loc[("India", "Hyderabad"):("Iraq", "Baghdad")]

                         date avg_temp_c
country city
India   Hyderabad  2000-01-01     23.779
        Hyderabad  2000-02-01     25.826
        Hyderabad  2000-03-01     28.821
        Hyderabad  2000-04-01     32.698
        Hyderabad  2000-05-01     32.438
...                       ...        ...
Iraq    Baghdad    2013-05-01     28.673
        Baghdad    2013-06-01     33.803
        Baghdad    2013-07-01     36.392
        Baghdad    2013-08-01     35.463
        Baghdad    2013-09-01        NaN

[1980 rows x 2 columns]

- Use `.loc[]` slicing to subset columns from date to `avg_temp_c`.

In [21]:
# Subset columns from date to avg_temp_c
temperatures_srt.loc[:,"date":"avg_temp_c"]

                          date avg_temp_c
country     city
Afghanistan Kabul   2000-01-01      3.326
            Kabul   2000-02-01      3.454
            Kabul   2000-03-01      9.612
            Kabul   2000-04-01     17.925
            Kabul   2000-05-01     24.658
...                        ...        ...
Zimbabwe    Harare  2013-05-01     18.298
            Harare  2013-06-01     17.020
            Harare  2013-07-01     16.299
            Harare  2013-08-01     19.232
            Harare  2013-09-01        NaN

[16500 rows x 2 columns]

- Slice in both directions at once from Hyderabad to Baghdad, and date to `avg_temp_c`.

In [22]:
# Subset in both directions at once
temperatures_srt.loc[("India", "Hyderabad"):("Iraq", "Baghdad"),"date":"avg_temp_c"]

                         date avg_temp_c
country city
India   Hyderabad  2000-01-01     23.779
        Hyderabad  2000-02-01     25.826
        Hyderabad  2000-03-01     28.821
        Hyderabad  2000-04-01     32.698
        Hyderabad  2000-05-01     32.438
...                       ...        ...
Iraq    Baghdad    2013-05-01     28.673
        Baghdad    2013-06-01     33.803
        Baghdad    2013-07-01     36.392
        Baghdad    2013-08-01     35.463
        Baghdad    2013-09-01        NaN

[1980 rows x 2 columns]

### **Slicing time series**

Slicing is particularly useful for time series, since it's a common thing to want to filter for data within a date range. Add the `date` column to the index, then use `.loc[]` to perform the subsetting. The important thing to remember is to keep your dates in ISO 8601 format, that is, `yyyy-mm-dd`.

Recall from Chapter 1 that you can combine multiple Boolean conditions using logical operators (such as `&`). To do so in one line of code you'll need to add parentheses `()` around each condition.

`pandas` is loaded as `pd` and `temperatures`, with no index, is available.

In [23]:
temperatures = pd.read_csv("./DataSets/temperatures.csv")

In [24]:
temperatures['date'] = pd.to_datetime(temperatures['date'])
temperatures['avg_temp_c'] = temperatures['avg_temp_c'].astype(float)
temperatures.dtypes

date          datetime64[ns]
city                  object
country               object
avg_temp_c           float64
dtype: object

- Use Boolean conditions (not `.isin()` or `.loc[]`) to subset for rows in 2010 and 2011, and print the results.
    - Note that because the date isn't set as an index, a condition that contains only a year, such as `df["date"] == "2009"`, will check if the date is equal to the first day of the first month of the year (e.g. `2009-01-01`), rather than checking whether the date occurs within the given year. We recommend writing out the full date when using Boolean conditions (e.g. `2009-12-31`).

In [25]:
# Use Boolean conditions to subset temperatures for rows in 2010 and 2011
temperatures_bool = temperatures[(temperatures["date"] >= "2010-01-01") & (temperatures["date"] <= "2011-12-31")]
temperatures_bool

            date     city        country  avg_temp_c
120   2010-01-01  Abidjan  Côte D'Ivoire      28.270
121   2010-02-01  Abidjan  Côte D'Ivoire      29.262
122   2010-03-01  Abidjan  Côte D'Ivoire      29.596
123   2010-04-01  Abidjan  Côte D'Ivoire      29.068
124   2010-05-01  Abidjan  Côte D'Ivoire      28.258
...          ...      ...            ...         ...
16474 2011-08-01     Xian          China      23.069
16475 2011-09-01     Xian          China      16.775
16476 2011-10-01     Xian          China      12.587
16477 2011-11-01     Xian          China       7.543
16478 2011-12-01     Xian          China      -0.490

[2400 rows x 4 columns]

- Set the index to the `date` column.

In [26]:
# Set date as an index
temperatures_ind = temperatures.set_index("date")
temperatures_ind.head()

               city        country  avg_temp_c
date
2000-01-01  Abidjan  Côte D'Ivoire      27.293
2000-02-01  Abidjan  Côte D'Ivoire      27.685
2000-03-01  Abidjan  Côte D'Ivoire      29.061
2000-04-01  Abidjan  Côte D'Ivoire      28.162
2000-05-01  Abidjan  Côte D'Ivoire      27.547

- Use `.loc[]` to subset for rows in 2010 and 2011.

In [27]:
# Use .loc[] to subset temperatures_ind for rows in 2010 and 2011
temperatures_ind.loc["2010-01-01":"2011-12-31"].head()

               city        country  avg_temp_c
date
2010-01-01  Abidjan  Côte D'Ivoire      28.270
2010-02-01  Abidjan  Côte D'Ivoire      29.262
2010-03-01  Abidjan  Côte D'Ivoire      29.596
2010-04-01  Abidjan  Côte D'Ivoire      29.068
2010-05-01  Abidjan  Côte D'Ivoire      28.258

In [28]:
temperatures_ind.loc["2010-08-01":"2011-02-28"].head()

               city        country  avg_temp_c
date
2010-08-01  Abidjan  Côte D'Ivoire      25.400
2010-09-01  Abidjan  Côte D'Ivoire      25.710
2010-10-01  Abidjan  Côte D'Ivoire      26.397
2010-11-01  Abidjan  Côte D'Ivoire      27.446
2010-12-01  Abidjan  Côte D'Ivoire      27.666

### **Subsetting by row/column number**
The most common ways to subset rows are the ways we've previously discussed: using a Boolean condition, or by index labels. However, it is also occasionally useful to pass row numbers.

This is done using `.iloc[]`, and like `.loc[]`, it can take two arguments to let you subset by rows and columns.

`pandas` is loaded as `pd`. `temperatures` (without an index) is available.

- Use `.iloc[]` on temperatures to take subsets.

    - Get the 23rd row, 2nd column (index positions 22 and 1).
    - Get the first 5 rows (index positions 0 to 5).
    - Get all rows, columns 3 and 4 (index positions 2 to 4).
    - Get the first 5 rows, columns 3 and 4.

In [29]:
# Get 23rd row, 2nd column (index 22, 1)
temperatures.iloc[22:23,1:2]

       city
22  Abidjan

In [30]:
# Use slicing to get the first 5 rows
temperatures.iloc[:5]

        date     city        country  avg_temp_c
0 2000-01-01  Abidjan  Côte D'Ivoire      27.293
1 2000-02-01  Abidjan  Côte D'Ivoire      27.685
2 2000-03-01  Abidjan  Côte D'Ivoire      29.061
3 2000-04-01  Abidjan  Côte D'Ivoire      28.162
4 2000-05-01  Abidjan  Côte D'Ivoire      27.547

In [31]:
# Use slicing to get columns 3 to 4
temperatures.iloc[:,2:4]

             country  avg_temp_c
0      Côte D'Ivoire      27.293
1      Côte D'Ivoire      27.685
2      Côte D'Ivoire      29.061
3      Côte D'Ivoire      28.162
4      Côte D'Ivoire      27.547
...              ...         ...
16495          China      18.979
16496          China      23.522
16497          China      25.251
16498          China      24.528
16499          China         NaN

[16500 rows x 2 columns]

In [32]:
# Use slicing in both directions at once
temperatures.iloc[:5,2:4]

         country  avg_temp_c
0  Côte D'Ivoire      27.293
1  Côte D'Ivoire      27.685
2  Côte D'Ivoire      29.061
3  Côte D'Ivoire      28.162
4  Côte D'Ivoire      27.547

## **Working with pivot-tables**

### **Pivot temperature by city and year**

It's interesting to see how temperatures for each city change over time. Looking at every month results in a big table, which can be tricky to reason about. Instead, let's look at how temperatures change by year.

You can access the components of a date (year, month and day) using code of the form `dataframe["column"].dt.component`. For example, the month component is `dataframe["column"].dt.month`, and the year component is `dataframe["column"].dt.year`.

Once you have the year column, you can create a pivot table with the data aggregated by city and year, which you'll explore in the coming exercises.

`pandas` is loaded as `pd`. `temperatures` is available.

- Add a `year` column to `temperatures`, from the year component of the `date` column.

In [33]:
# Add a year column to temperatures
temperatures["year"] = temperatures["date"].dt.year
temperatures.head()

        date     city        country  avg_temp_c  year
0 2000-01-01  Abidjan  Côte D'Ivoire      27.293  2000
1 2000-02-01  Abidjan  Côte D'Ivoire      27.685  2000
2 2000-03-01  Abidjan  Côte D'Ivoire      29.061  2000
3 2000-04-01  Abidjan  Côte D'Ivoire      28.162  2000
4 2000-05-01  Abidjan  Côte D'Ivoire      27.547  2000

- Make a pivot table of the `avg_temp_c` column, with `country` and `city` as rows, and `year` as columns. Assign to `temp_by_country_city_vs_year`, and look at the result.

In [34]:
# Pivot avg_temp_c by country and city vs year
temperatures['year'].astype(float)
temp_by_country_city_vs_year = temperatures.pivot_table("avg_temp_c", 
                                                        index=["country","city"], 
                                                        columns="year", )

# See the result
temp_by_country_city_vs_year

year                                 2000       2001       2002       2003  \
country       city
Afghanistan   Kabul             15.822667  15.847917  15.714583  15.132583
Angola        Luanda            24.410333  24.427083  24.790917  24.867167
Australia     Melbourne         14.320083  14.180000  14.075833  13.985583
              Sydney            17.567417  17.854500  17.733833  17.592333
Bangladesh    Dhaka             25.905250  25.931250  26.095000  25.927417
...                                   ...        ...        ...        ...
United States Chicago           11.089667  11.703083  11.532083  10.481583
              Los Angeles       16.643333  16.466250  16.430250  16.944667
              New York           9.969083  10.931000  11.252167   9.836000
Vietnam       Ho Chi Minh City  27.588917  27.831750  28.064750  27.827667
Zimbabwe      Harare            20.283667  20.861000  21.079333  20.889167

year                                 2004       2005       2006       2007  \
country       city
Afghanistan   Kabul             16.128417  14.847500  15.798500  15.518000
Angola        Luanda            24.216167  24.414583  24.138417  24.241583
Australia     Melbourne         13.742083  14.378500  13.991083  14.991833
              Sydney            17.869667  18.028083  17.749500  18.020833
Bangladesh    Dhaka             26.136083  26.193333  26.440417  25.951333
...                                   ...        ...        ...        ...
United States Chicago           10.943417  11.583833  11.870500  11.448333
              Los Angeles       16.552833  16.431417  16.623083  16.699917
              New York          10.389500  10.681417  11.519250  10.627333
Vietnam       Ho Chi Minh City  27.686583  27.884000  28.044000  27.866667
Zimbabwe      Harare            20.307667  21.487417  20.699750  20.746250

year                                 2008       2009       2010       2011  \
country       city
Afghanistan   Kabul             15.479250  15.093333  15.676000  15.812167
Angola        Luanda            24.266333  24.325083  24.440250  24.150750
Australia     Melbourne         14.110583  14.647417  14.231667  14.190917
              Sydney            17.321083  18.175833  17.999000  17.713333
Bangladesh    Dhaka             26.004500  26.535583  26.648167  25.803250
...                                   ...        ...        ...        ...
United States Chicago           10.242417  10.298333  11.815917  11.214250
              Los Angeles       17.014750  16.677000  15.887000  15.874833
              New York          10.641667  10.141833  11.357583  11.272250
Vietnam       Ho Chi Minh City  27.611417  27.853333  28.281750  27.675417
Zimbabwe      Harare            20.680500  20.523833  21.165833  20.781750

year                                 2012       2013
country       city
Afghanistan   Kabul             14.510333  16.206125
Angola        Luanda            24.240083  24.553875
Australia     Melbourne         14.268667  14.741500
              Sydney            17.474333  18.089750
Bangladesh    Dhaka             26.283583  26.587000
...                                   ...        ...
United States Chicago           12.821250  11.586889
              Los Angeles       17.089583  18.120667
              New York          11.971500  12.163889
Vietnam       Ho Chi Minh City  28.248750  28.455000
Zimbabwe      Harare            20.523333  19.756500

[98 rows x 14 columns]

### **Subsetting pivot tables**

A pivot table is just a DataFrame with sorted indexes, so the techniques you have learned already can be used to subset them. In particular, the `.loc[]` + slicing combination is often helpful.

`pandas` is loaded as `pd`. `temp_by_country_city_vs_year` is available.

- Use `.loc[]` on `temp_by_country_city_vs_year` to take subsets.

    - From Egypt to India.
    - From Egypt, Cairo to India, Delhi.
    - From Egypt, Cairo to India, Delhi and 2005 to 2010.

In [35]:
# Subset for Egypt to India
temp_by_country_city_vs_year.loc["Egypt":"India"]

# Subset for Egypt, Cairo to India, Delhi
temp_by_country_city_vs_year.loc[("Egypt","Cairo"):("India","Delhi")]

# Subset in both directions at once
temp_by_country_city_vs_year.loc[("Egypt","Cairo"):("India","Delhi"),"2005":"2010"]

year                       2005       2006       2007       2008       2009  \
country  city
Egypt    Cairo        22.006500  22.050000  22.361000  22.644500  22.625000
         Gizeh        22.006500  22.050000  22.361000  22.644500  22.625000
Ethiopia Addis Abeba  18.312833  18.427083  18.142583  18.165000  18.765333
Germany  Berlin        9.919083  10.545333  10.883167  10.657750  10.062500
India    Ahmadabad    26.828083  27.282833  27.511167  27.048500  28.095833
         Bangalore    25.476500  25.418250  25.464333  25.352583  25.725750
         Bombay       27.035750  27.381500  27.634667  27.177750  27.844500
         Calcutta     26.729167  26.986250  26.584583  26.522333  27.153250
         Delhi        25.716083  26.365917  26.145667  25.675000  26.554250

year                       2010
country  city
Egypt    Cairo        23.718250
         Gizeh        23.718250
Ethiopia Addis Abeba  18.298250
Germany  Berlin        8.606833
India    Ahmadabad    28.017833
         Bangalore    25.705250
         Bombay       27.765417
         Calcutta     27.288833
         Delhi        26.520250

### **Calculating on a pivot table**

Pivot tables are filled with summary statistics, but they are only a first step to finding something insightful. Often you'll need to perform further calculations on them. A common thing to do is to find the rows or columns where a highest or lowest value occurs.

Recall from Chapter 1 that you can easily subset a Series or DataFrame to find rows of interest using a logical condition inside of square brackets. For example: `series[series > value]`.

`pandas` is loaded as `pd` and the DataFrame `temp_by_country_city_vs_year` is available.

- Calculate the mean temperature for each year, assigning to `mean_temp_by_year`.
- Filter `mean_temp_by_year` for the year that had the highest mean temperature.

In [36]:
# Get the worldwide mean temp by year
mean_temp_by_year = temp_by_country_city_vs_year.mean()

In [37]:
# Filter for the year that had the highest mean temp
mean_temp_by_year[mean_temp_by_year==mean_temp_by_year.max()]

year
2013    20.549145
dtype: float64

- Calculate the mean temperature for each city (across columns), assigning to `mean_temp_by_city`.
- Filter `mean_temp_by_city` for the city that had the lowest mean temperature.

In [38]:
# Get the mean temp by city
mean_temp_by_city = temp_by_country_city_vs_year.mean(axis="columns")

# Filter for the city that had the lowest mean temp
mean_temp_by_city[mean_temp_by_city == mean_temp_by_city.min()]

country  city
Russia   Saint Petersburg    5.409226
dtype: float64